print("========================================================================================")
import pandas as pd
import numpy as np


df = pd.DataFrame({'A': {0: 'a', 1: 'b', 2: 'c'},
                   'B': {0: 1, 1: 3, 2: 5},
                   'C': {0: 2, 1: 4, 2: 6}})

print(df)

print("========================================================================================")
help(pd.melt)

print("========================================================================================")
print(df)

print("========================================================================================")
print(pd.melt(df, id_vars=['A'], value_vars=['B','C']))   #열의 값을 행으로 옮김

print("========================================================================================")
print(pd.melt(df, value_vars=['A', 'B', 'C'])
      .rename(columns={'variable' : 'var',  'value' : 'val'})) #열이름 변경

print("========================================================================================")
#help(df.pivot)
df2 = pd.DataFrame({'foo': ['one', 'one', 'one', 'two', 'two','two'],
                   'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'baz': [1, 2, 3, 4, 5, 6],
                   'zoo': ['x', 'y', 'z', 'q', 'w', 't']})
print(df2)

print("========================================================================================")
df2=df2.pivot(index='foo', columns='bar', values='baz').reset_index() #열의 값이 행으로 이동, 인덱스를 새로 만들어줌
print(df2)

k=df2.melt(id_vars=['foo'], value_vars=['A','B', 'C']).sort_values(['foo','bar']).rename(columns={'values':'baz'})   #foo, bar를 기준으로 정렬
print(k)




